6_semester/КИСП/Курсовая/src/Documents/ЗаказУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗаказУслуги</Name>
			<BasedOn>
				<xr:Item>Document.СеансБронирования</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.Компьютеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

6_semester/КИСП/Курсовая/src/Documents/ЗаказУслуги/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	Данные = ПолучитьДанныеНоменклатуры(Объект.Номенклатура);
	Объект.Цена = Данные.Цена;
	РассчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	РассчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	РассчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСумму()
	Объект.Сумма = Объект.Цена * Объект.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьУслугу(Команда)
	Если Объект.Завершен Тогда
		Сообщить("Услуга уже завершена!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Сначала запишите и проведите документ!");
		Возврат;
	КонецЕсли;
	
	ЗавершитьУслугуНаСервере();
	Сообщить("Услуга успешно завершена. Созданы документы продажи и оплаты.");
КонецПроцедуры

&НаСервере
Процедура ЗавершитьУслугуНаСервере()
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ЗавершитьЗаказ();
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
КонецПроцедуры
Функция ПолучитьДанныеНоменклатуры(Номенклатура)
	Данные = Новый Структура("Цена", 0);
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Данные.Цена = Номенклатура.Цена;
	КонецЕсли;
	Возврат Данные;
КонецФункции
